system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Vertices for a NACA 0012-style boundary
vertices
(
    (-0.5 -0.5 -0.1) // 0
    ( 1.5 -0.5 -0.1) // 1
    ( 1.5  0.5 -0.1) // 2
    (-0.5  0.5 -0.1) // 3
    (-0.5 -0.5  0.1) // 4
    ( 1.5 -0.5  0.1) // 5
    ( 1.5  0.5  0.1) // 6
    (-0.5  0.5  0.1) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    walls
    {
        type wall;
        faces ((0 1 5 4) (3 7 6 2));
    }
    frontAndBack
    {
        type empty;
        faces ((0 3 2 1) (4 5 6 7));
    }
);

// ************************************************************************* //

