system/snappyHexMeshDictsnappyHexMesh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    blade_surface
    {
        type    searchableCylinder;
        point1  (0.5 0 -0.1);
        point2  (0.5 0  0.1);
        radius  0.1;
    }
};

castellatedMeshControls
{
    features ();
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces true;

    refinementSurfaces
    {
        blade_surface
        {
            level (2 2);
        }
    }
    refinementRegions {}
    locationInMesh (0.1 0.1 0);
}
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}
addLayersControls {}
meshQualityControls {}
mergeTolerance 1e-6;
