0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (10 0 0);
boundaryField
{
    inlet           { type fixedValue; value uniform (10 0 0); }
    outlet          { type zeroGradient; }
    walls           { type noSlip; }
    frontAndBack    { type empty; }
    blade_surface   { type noSlip; }
}
