system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers { 
    p { solver PCG; preconditioner DIC; tolerance 1e-06; relTol 0.01; }
    U { solver PBiCGStab; preconditioner DILU; tolerance 1e-05; relTol 0.1; }
}
SIMPLE { nNonOrthogonalCorrectors 2; }
relaxationFactors { fields { p 0.3; } equations { U 0.7; } }
